{
  "nothing": [
    "You knock on doors all day, but nobody answers.",
    "You beg at the bus stop but everyone’s in a hurry.",
    "A pigeon poops on your hat and you walk away empty-handed.",
    "You wave your hands pleadingly, but people just walk past.",
    "You shout for help, but all you hear is traffic noise.",
    "You stand on a street corner with your cup, but no one stops.",
    "A sudden rainstorm scatters your flyers; you get nothing.",
    "You sing a sad song, but it goes unheard.",
    "You ask a passerby, but they shake their head and keep going.",
    "Your sign reads “Need money,” but no one takes a glance.",
    "Your heartfelt speech is drowned out by loud car horns.",
    "You search your pockets for change, but find none.",
    "Your outstretched hand waits, but cash stays in pockets.",
    "A stray dog sniffs your coins and wanders off with nothing.",
    "You plead with a conductor, but he closes the gate.",
    "You approach a group, but they ignore you completely.",
    "A street vendor shoos you away without a word.",
    "You practice your pitch, but it doesn't move anyone.",
    "Your cup remains empty under the scorching sun.",
    "You wander alleys calling for help, but get only silence."
  ],
  "lose": [
    "A grumpy stranger kicks your cup and you lose ${amount}.",
    "Someone trips you and snatches ${amount} from your pocket.",
    "You trip over a curb and spill your coins—lost ${amount}.",
    "A pickpocket takes advantage of your distraction and you’re down ${amount}.",
    "The bus driver fines you ${amount} for fare evasion.",
    "Your cup was stolen and you’re ${amount} short.",
    "A gust of wind blows your hat away with ${amount} inside.",
    "A street racer revs past and knocks your coins away—you lose ${amount}.",
    "You drop your money into a grate—${amount} is gone forever.",
    "A shady character distracts you, then pockets ${amount}.",
    "You miscount your change and accidentally give away ${amount}.",
    "A vendor charges you ${amount} for a water bottle you didn’t buy.",
    "A stray dog knocks over your coins and you lose ${amount}.",
    "Someone in a crowd bumps you and you can’t find ${amount}.",
    "You gamble your last ${amount} and lose it all.",
    "A homeless shelter surcharge leaves you ${amount} poorer.",
    "Your bicycle tip jar is jostled, spilling ${amount}.",
    "A scammer convinces you to hand over ${amount}.",
    "Your wallet falls out and you’re down ${amount}.",
    "A fake charity takes ${amount} from your collection."
  ],
  "win": [
    "A kindly grandma slips you ${amount} and pats your shoulder.",
    "A fellow student shares their lunch money—${amount} is yours.",
    "A passing tourist mistakes you for a local guide and gives you ${amount}.",
    "A street performer tips you ${amount} for your encouragement.",
    "A delivery driver tosses you ${amount} “for coffee, friend.”",
    "A busker offers you ${amount} after you applaud their tune.",
    "A jogger hands you ${amount} to rest your feet.",
    "A kind stranger places ${amount} in your hat.",
    "Someone pays forward ${amount} to you at a café.",
    "A lost tourist mistakes your sign and gives you ${amount}.",
    "A charity worker drops ${amount} in your cup by accident thinking you’re with them.",
    "A security guard sees you tired and gives you ${amount}.",
    "A shopkeeper rounds up their change—${amount} for you.",
    "A cyclist rewards your directions with ${amount}.",
    "A commuter hands you ${amount} for being polite.",
    "An old friend stops by and slips you ${amount} quietly.",
    "A newspaper vendor shares ${amount} after a friendly chat.",
    "A musician gifts you ${amount} for your compliments.",
    "A delivery courier thanks you and leaves ${amount}.",
    "A Samaritan overhears your story and donates ${amount}."
  ]
}
